import discord
from discord.ext import commands

intents = discord.Intents.default()

intents.message_content = True

bot = commands.Bot(command_prefix='/', intents=intents)
#Оповищение в консоль что бот работает 
@bot.event
async def on_ready():
    print(f'We have logged in as {bot.user}')
#Приветствие 1
@bot.command()
async def hello(ctx):
    await ctx.send('Привет! Я бот, хочу рассказть тебе о вреде неправильной утилизации мусора. Чтобы узнать подробнее введите "/helps"')
#Команда 2
@bot.command()
async def helps(ctx):
    await ctx.send('список команд:')
    await ctx.send('1. /hello - Запуск бота,')
    await ctx.send('2. /help - Помощь в командах,')
    await ctx.send('3. /disposal - Что нельзя утилизировать и как это сделать правильно,')
    await ctx.send('4. /Unfolded - Время разложения предметов,')
    await ctx.send('5. /solution - Как решить эти проблемы.')

'''
/disposal
'''
#предметы
@bot.command()
async def disposal(ctx) : #/disposal
    await ctx.send("Выберите предмет, чтобы узнать подробние: термометр, батарейки, пластиковые пакеты, стекло, лекарства. Для выбора напишите '/disposal+ порядковый номер в списке'. Пример: '/disposal2 (батарейки)'")
#термометр
@bot.command()
async def disposal1(ctx) : #/термометр
    await ctx.send("В них есть ртуть, это с детства помнят все. Но далеко не каждый знает, как поступить с градусником, который больше не нужен. Если просто выбросить его в ведро, с большой долей вероятности он разобьется при дальнейшей транспортировке мусора, будет отравлять окружающую среду, а также тех, кто находится рядом – и людей, и животных. Они относятся к первому классу опасных отходов и требуют специальной утилизации.")
#батарейки
@bot.command()
async def disposal2(ctx): #/батарейки
    await ctx.send("Тоже содержат вредные вещества, которые попадают в окружающую среду при любой обычной переработке мусора. Если батарейки жечь, эти вещества попадают в воздух, если просто отправить на свалку – окажутся в почве. К тому же, батарейки очень долго разлагаются – более ста лет они могут отравлять нашу планету.Куда отдать? Возможно, в вашем городе есть пункты приема батареек. Специальные стеклянные ящики установлены, например, в сети магазинов ВкусВилл, что очень удобно для тех, кто регулярно покупает там продукты.Батарейки можно также отнести в пункт приема опасных бытовых отходов. Именно так желательно поступать с щелочными батарейками.")
#пластиковые пакеты
@bot.command()
async def disposal3(ctx): #/пластиковые пакеты
    await ctx.send("Полиэтилен разлагается в природе более ста лет, пластик – в пять раз дольше. А вот целлофан, кстати, не так вреден, он разлагается всего два-четыре года и не наносит природе большого вреда. Но целлофана в нашем быту сравнительно немного – это те прозрачные хрусткие пленки, в которые упаковывают печенье, шоколад, некоторые другие виды продуктов.Куда отдать? Самое простое решение – складывать пластик и полиэтилен в специальный контейнер, из которого они отправятся на переработку. Многие города сейчас постепенно переходят на систему раздельного сбора мусора, и в обычных дворах устанавливают «профильные» контейнеры для того или иного вида отходов. Работает эта система даже в столице пока из рук вон плохо, но при желании найти специальный контейнер в своем городе можно.И еще один совет для любителей природы: все пакеты и упаковку можно использовать повторно (и даже больше раз). Купить пакет в магазине – удобно и не напрягает, но это не значит,  что дома он может сразу отправляться в мусорное ведро. А для тех, кто совсем не хочет вносить свой вклад в загрязнения окружающей среды, тоже есть решение: холщовые сумки, стремительно вновь вошедшие в моду авоськи и тканевые мешочки для весовых продуктов.")
#стекло
@bot.command()
async def disposal4(ctx): #/стекло
    await ctx.send("Стекло можно было бы считать абсолютно безобидным для природы продуктом переработки песка, имеющим тот же самый химический состав, и в песок в итоге когда-нибудь превратится любой выброшенный стеклянный предмет.Но есть важное «но», и не одно! Бутылки и другие выброшенные стеклянные предметы обычно рано или поздно разбиваются, и острые края осколков первое время могут поранить животных, да и людей тоже.Также выброшенные бутылки и другие вогнутые или выпуклые стеклянные предметы в летний день могут фокусировать солнечные лучи, так что из-за них возможны возгорания сухой растительности и пожары.Наконец, любой мусор, и стеклянный тоже, резко ухудшает эстетические характеристики ландшафта.Так что ненужное стекло следует перерабатывать или как минимум захоранивать,")
#лекарства
@bot.command()
async def disposal5(ctx): #/лекарства
    await ctx.send("Если вы решили разобрать домашнюю аптечку и обнаружили ненужные вам препараты или лекарства с истекших сроком годности, не спешите нести их в мусорное ведро и не спускайте в унитаз. Лекарственные средства – сложные химические соединения, на свалке они будут отравлять окружающую среду. А если до них доберутся животные, то они могут серьезно отравиться. Могут отравлять лекарства и воду, от этого будет страдать не только экология, но и существа, обитающие в воде.Куда отдать? Если лекарства еще пригодны к употреблению, но вам больше не нужны, можно отдать их благотворительным организациям, которые занимаются сбором таких средств, – например, в «Аптекашеринг» или «Таблетки даром».Если лекарства просроченные и вы выкидываете их в обычный мусор, предварительно измельчите таблетки, вскройте пузырьки и ампулы, смешайте полученный порошок или жидкость с чем-то непривлекательным (содержимое кошачьего лотка, начавшая гнить органика) и только после этого выбрасывайте. Это минимизирует риск того, что до лекарств доберутся животные.")
'''
/Unfolded
'''
@bot.command()
async def Unfolded(ctx) : #/Unfolded
    await ctx.send("Выберите предмет, чтобы узнать подробние: термометр, батарейки, пластиковые пакеты, стекло, лекарства Для выбора напишите '/Unfolded + порядковый номер в списке'. Пример: '/Unfolded2 (батарейки)'")
#термометр
@bot.command()
async def Unfolded1(ctx) : #/Unfolded термометр
    await ctx.send("В среднем около 3 лет. Скорость испарения ртути напрямую зависит от температуры в помещении, где находится разбитый термометр, а также от динамики поступления чистого воздуха не сквозным способом.")
#батарейки
@bot.command()
async def Unfolded2(ctx) : #/Unfolded батарейки
    await ctx.send("Обычная батарейка может нанести огромный урон окружающей среде, если просто бросить ее в мусорное ведро, а не сдать в специальные пункты приема. Время полного цикла переработки 1 батарейки – 4 дня. Время разложения 1 батарейки на земле – 36 525 дней, или 100 лет. Одна батарейка отравляет 20 кубометров земли или 400 литров воды!")
#пластиковые пакеты
@bot.command()
async def Unfolded3(ctx) : #/Unfolded пластиковые пакеты
    await ctx.send("Среднее время разложения пластмассовых изделий, созданных по разным технологиям, колеблется от 6 месяцев до 700 лет. Полиэтиленовые пакеты, которые повседневно используются людьми, в природе разлагаются от 100 до 200 лет. Это обратная сторона прочности и долговечности пластиковых изделий. При этом стеклянная бутылка может разлагаться до 1 млн лет.")
#стекло
@bot.command()
async def Unfolded4(ctx) : #/Unfolded стекло
    await ctx.send("Срок разложения стекла — более 1000 лет, еще как минимум 12-15 поколений будет наслаждаться нашими осколками.")
#лекарства
@bot.command()
async def Unfolded5(ctx) : #/Unfolded лекарства
    await ctx.send("время разложения меньше месяца")
'''
/solution
'''
#Выводы
@bot.command()
async def solution(ctx) : #/solution
    await ctx.send("Избавиться от отходов можно следующими способами: 1. сортировка и повторное использование пригодных изделий;2. захоронение на оборудованных полигонах;3. сжигание или переработка на специальных предприятиях;4. компостирование и приготовление удобрений из отходов пищевой промышленности;5. пиролиз – сжигание в бескислородных высокотемпературных печах.")
#Прощание
@bot.command()
async def bye(ctx) : #/bye
    await ctx.send("Помоги нашей планете! До свидания, всего доброго!")

bot.run("Токен")
